
'''
dic = {'江西': {'南昌': ['南昌县', '安义县', '进贤县'],
              '宜春': ['袁州区', '上高县', '万载县'],
              '九江': ['庐山区', '修水县', '都昌县']},
       '浙江': {'杭州': ['萧山区', '西湖区', '余杭区'],
              '温州': ['平阳县', '乐清市', '苍南县'],
              '宁波': ['镇海区', '江北区', '江东区']},
       '湖南': {'长沙': ['芙蓉区', '天心区', '开福区'],
              '衡阳': ['南岳区', '石鼓区', '珠晖区'],
              '岳阳': ['云溪区', '湘阴县', '君山区']}}

#先把初识地区信息写入文件

import json
with open('地区信息库.txt','w') as area_file:
    area_str = json.dumps(dic)
    area_file.write(area_str)

'''















